


#include <linux/module.h>

#include <linux/fs.h>
#include <linux/errno.h>
#include <linux/kernel.h>
#include <linux/major.h>
#include <linux/stat.h>
#include <linux/init.h>
#include <linux/device.h>
#include <linux/tty.h>
#include <linux/kmod.h>
#include <linux/syscalls.h>
#include <linux/smp.h>
#include <linux/slab.h>
#include <linux/delay.h>
#include <linux/io.h>
#include <linux/ioport.h>
#include <linux/poll.h>
#include <linux/wait.h>
#include <linux/interrupt.h>
#include <linux/irq.h>
#include <linux/i2c.h>
#include <linux/gpio.h>

// #define	LOCAL_DEBUG_LOG
#define	DEMO_CFG_SW_PU_ENABLE

#define	DEVICE_NAME			("demo_device")
#define	CONTROL_DEVICE_MAX	(1u)

#define	DEMO_DEV_IOCTL_SET_SW_IRQ		(0x0001)
#define	DEMO_DEV_IOCTL_GET_BME280		(0x0100)
#define	DEMO_DEV_IOCTL_SET_ILM_00		(0x0200)
#define	DEMO_DEV_IOCTL_SET_ILM_01		(0x0201)
#define	DEMO_DEV_IOCTL_GET_ILM_00		(0x0210)
#define	DEMO_DEV_IOCTL_GET_ILM_01		(0x0211)

#define	DEMO_DEV_READ_REBOOT			(0x00)
#define	DEMO_DEV_READ_POWOFF			(0x01)

#define BCM2835_CFG_GPIO_SW_BASE		(20)
#define BCM2835_CFG_GPIO_SW_REBOOT		\
		(BCM2835_CFG_GPIO_SW_BASE + DEMO_DEV_READ_REBOOT)
#define BCM2835_CFG_GPIO_SW_POWOFF		\
		(BCM2835_CFG_GPIO_SW_BASE + DEMO_DEV_READ_POWOFF)

#define	BCM2835_CFG_PWM_FSEL_ALT0		(0)
#define	BCM2835_CFG_PWM_FSEL_ALT5		(5)
#define	BCM2835_CFG_PWM0_FSEL_ALT		BCM2835_CFG_PWM_FSEL_ALT0
#define	BCM2835_CFG_PWM1_FSEL_ALT		BCM2835_CFG_PWM_FSEL_ALT0

#define	HSWAP(x)	(x)

// #define	BCM2835_REG_PWM_BASE		(0x7e20c000)
// #define	BCM2835_REG_GP_BASE			(0x7e200000)
// #define	BCM2835_REG_CM_BASE			(0x7e101000)
#define	BCM2835_REG_PWM_BASE			(0x3f20c000)
#define	BCM2835_REG_GP_BASE				(0x3f200000)
#define	BCM2835_REG_CM_BASE				(0x3f101000)

#define	BCM2835_PWM_PERIOD				(1024u)

#define	BME280_I2C_CH					(1)
#define	BME280_SLAVE_ADDRESS			(0x76)

#define	BME280_REG_HUM_MSB				(0xfd)
#define	BME280_REG_HUM_LSB				(0xfe)
#define	BME280_REG_TEMP_MSB				(0xfa)
#define	BME280_REG_TEMP_LSB				(0xfb)
#define	BME280_REG_PRESS_MSB			(0xf7)
#define	BME280_REG_PRESS_LSB			(0xf8)

#define	BME280_REG_CONFIG				(0xf5)
#define	BME280_REG_CTRL_MEAS			(0xf4)
#define	BME280_REG_STATUS				(0xf3)
#define	BME280_REG_CTRL_HUM				(0xf2)

#define	BME280_REG_RESET				(0xe0)
#define	BME280_REG_ID					(0xd0)

#define	BME280_REG_CTRL_MEAS_VAL		((1 << 5) | (1 << 2) | (1))
#define	BME280_REG_CTRL_HUM_VAL			(0x01)

#define	BME280_REG_CTRL_MEAS_MODE_MSK	(0x03)
#define	BME280_REG_STATUS_MERSURING_MSK	(0x08)

typedef	struct demo_drv_ioctl_bme280_info_t {
	uint32_t	temp;
	uint32_t	press;
	uint32_t	hum;
}	demo_drv_ioctl_bme280_info_t;

typedef	struct bcm2835_reg_pwm_t {
	uint32_t	ctl;
	uint32_t	sta;
	uint32_t	dmac;
	uint32_t	reserve1;
	uint32_t	rng1;
	uint32_t	dat1;
	uint32_t	fif1;
	uint32_t	reserve2;
	uint32_t	rng2;
	uint32_t	dat2;
}	bcm2835_reg_pwm_t;

typedef	struct bcm2835_reg_gp_t {
	uint32_t	fsel0;
	uint32_t	fsel1;
	uint32_t	fsel2;
	uint32_t	fsel3;
	uint32_t	fsel4;
	uint32_t	fsel5;
	uint32_t	reserve1;
	uint32_t	set0;
	uint32_t	set1;
	uint32_t	reserve2;
	uint32_t	clr0;
	uint32_t	clr1;
	uint32_t	reserve3;
	uint32_t	lev0;
	uint32_t	lev1;
	uint32_t	reserve4;
	uint32_t	eds0;
	uint32_t	eds1;
	uint32_t	reserve5;
	uint32_t	ren0;
	uint32_t	ren1;
	uint32_t	reserve6;
	uint32_t	fen0;
	uint32_t	fen1;
	uint32_t	reserve7;
	uint32_t	hen0;
	uint32_t	hen1;
	uint32_t	reserve8;
	uint32_t	len0;
	uint32_t	len1;
	uint32_t	reserve9;
	uint32_t	aren0;
	uint32_t	aren1;
	uint32_t	reserve10;
	uint32_t	afen0;
	uint32_t	afen1;
	uint32_t	reserve11;
	uint32_t	pud;
	uint32_t	pudclk0;
	uint32_t	pudclk1;
}	bcm2835_reg_gp_t;

#pragma	pack(1)
typedef	struct demo_drv_bme280_raw_calib_1st_t {
	uint16_t	dig_T1;			// 0x88 / 0x89
	uint16_t	dig_T2;			// 0x8A / 0x8B
	uint16_t	dig_T3;			// 0x8C / 0x8D
	uint16_t	dig_P1;			// 0x8E / 0x8F
	uint16_t	dig_P2;			// 0x90 / 0x91
	uint16_t	dig_P3;			// 0x92 / 0x93
	uint16_t	dig_P4;			// 0x94 / 0x95
	uint16_t	dig_P5;			// 0x96 / 0x97
	uint16_t	dig_P6;			// 0x98 / 0x99
	uint16_t	dig_P7;			// 0x9A / 0x9B
	uint16_t	dig_P8;			// 0x9C / 0x9D
	uint16_t	dig_P9;			// 0x9E / 0x9F
}	demo_drv_bme280_raw_calib_1st_t;

typedef	struct demo_drv_bme280_raw_calib_2nd_t {
	uint8_t		dig_H1;			// 0xA1
}	demo_drv_bme280_raw_calib_2nd_t;

typedef	struct demo_drv_bme280_raw_calib_3rd_t {
	uint16_t	dig_H2;			// 0xE1 / 0xE2
	uint8_t		dig_H3;			// 0xE3
	uint8_t		dig_H4_E4;		// 0xE4			dig_H4[11:4]
	uint8_t		dig_H4_E5 : 4;	// 0xE5[3:0]	dig_H4[3:0]
	uint8_t		dig_H5_E5 : 4;	// 0xE5[7:4]	dig_H5[3:0]
	uint8_t		dig_H5_E6;		// 0xE6			dig_H5[11:4]
	uint8_t		dig_H6;			// 0xE7
}	demo_drv_bme280_raw_calib_3rd_t;
#pragma	pack()

typedef	struct demo_drv_bme280_calib_t {
	uint16_t	dig_T1;	// 0x88 / 0x89
	int16_t		dig_T2;	// 0x8A / 0x8B
	int16_t		dig_T3;	// 0x8C / 0x8D
	uint16_t	dig_P1;	// 0x8E / 0x8F
	int16_t		dig_P2;	// 0x90 / 0x91
	int16_t		dig_P3;	// 0x92 / 0x93
	int16_t		dig_P4;	// 0x94 / 0x95
	int16_t		dig_P5;	// 0x96 / 0x97
	int16_t		dig_P6;	// 0x98 / 0x99
	int16_t		dig_P7;	// 0x9A / 0x9B
	int16_t		dig_P8;	// 0x9C / 0x9D
	int16_t		dig_P9;	// 0x9E / 0x9F
	uint8_t		dig_H1;	// 0xA1
	int16_t		dig_H2;	// 0xE1 / 0xE2
	uint8_t		dig_H3;	// 0xE3
	int16_t		dig_H4;	// 0xE4 / 0xE5[3:0]
	int16_t		dig_H5;	// 0xE5[7:4] / 0xE6
	int8_t		dig_H6;	// 0xE7
}	demo_drv_bme280_calib_t;

typedef struct demo_dev_devices_t	{
	struct class		*class_inst;
	dev_t				dev_inst;
	struct cdev			cdev_inst;
	struct i2c_client	*i2c;
	struct device		*dev[CONTROL_DEVICE_MAX];
	unsigned			assert_reboot;
	unsigned			assert_powoff;
}	demo_dev_devices_t;

extern void sc1602bs_initialize(void);
extern void sc1602bs_finalize(void);
extern void sc1602bs_indicate_string(char *str);
extern void sc1602bs_clear_display(void);

static int bme280_write_reg(struct i2c_client *client, char addr,
		unsigned char *data, int len);
static int bme280_read_reg(struct i2c_client *client, char addr,
		unsigned char *buff, int *len, int req_len);

static int __init	demo_dev_init_driver(void);
static void __exit	demo_dev_cleanup_driver(void);
static int	demo_dev_driver_open(struct inode *inode,
		struct file *filp);
static int	demo_dev_driver_release(struct inode *inode,
		struct file *filp);
static long	demo_dev_driver_ioctl(struct file *filp,
